app/views/address_sets/show.html.erb

SELECT "tokenized_addresses".* FROM "tokenized_addresses" WHERE "tokenized_addresses"."address_set_id" = ?  [["address_set_id", 3]]
---

<% @set.tokenized_addresses.each do |addr| %>