app/controllers/address_sets_controller.rb

  def create
    file_id = params[:uploaded_file_id]
    file = UploadedFile.find(file_id)
    # TODO BUG @set is nil in the view
    set = FileParser.create_address_set_from_file file
---
SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "address_sets" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 15 Jul 2013 02:36:43 UTC +00:00], ["updated_at", Mon, 15 Jul 2013 02:36:43 UTC +00:00]]

  def show
    @set = AddressSet.find(params[:id])
---
SELECT "address_sets".* FROM "address_sets" WHERE "address_sets"."id" = ? LIMIT 1  [["id", "3"]]