app/controllers/uploaded_files_controller.rb

  def create
    file   = params[:uploaded_file][:thefile]
    upload = UploadedFile.new {|u| u.file = file}

    if upload.save # before_create
---
INSERT INTO "uploaded_files" ("content", "created_at", "filename", "updated_at") VALUES (?, ?, ?, ?)  [["content", "a,b,c\r1,2,3\r11,12,13\r44,44,44\r5,5,5"], ["created_at", Sat, 13 Jul 2013 03:58:58 UTC +00:00], ["filename", "tester.csv"], ["updated_at", Sat, 13 Jul 2013 03:58:58 UTC +00:00]]

  def edit
    @file = UploadedFile.find(params[:id])
---
SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."id" = ? LIMIT 1  [["id", "3"]]

  def update
    @file = UploadedFile.find(params[:id])
    @file.update_attributes(address_column_index: params[:address_index])
---
SELECT "uploaded_files".* FROM "uploaded_files" WHERE "uploaded_files"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "uploaded_files" SET "address_column_index" = ?, "updated_at" = ? WHERE "uploaded_files"."id" = 8  [["address_column_index", 3], ["updated_at", Mon, 15 Jul 2013 01:15:05 UTC +00:00]]